Tekla Open API Reference for Tekla Structures 2025
RebarCrankingNullable.CrankingType Property
 Gets or sets the cranking type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarCrankingNullable.EndCrankingTypeEnum? CrankingType { get; set; }
Public Property CrankingType As RebarCrankingNullable.EndCrankingTypeEnum?
	Get
	Set
Property Value
Type: Nullable<RebarCrankingNullable.EndCrankingTypeEnum>
See Also
Reference
RebarCrankingNullable Class
Tekla.Structures.Model Namespace